src/CF/Catalogs/Изображения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Изображения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Договора</xr:Item>
				<xr:Item>Catalog.Клиенты</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.Поставщики</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
				<xr:Item>Document.ДвиженияДенег</xr:Item>
				<xr:Item>Document.Инвентаризации</xr:Item>
				<xr:Item>Document.КорректировкиИРегистрацияОстатков</xr:Item>
				<xr:Item>Document.ПеремещенияТовара</xr:Item>
				<xr:Item>Document.ПланыПродаж</xr:Item>
				<xr:Item>Document.ПоступленияТовара</xr:Item>
				<xr:Item>Document.УстановкиЦен</xr:Item>
				<xr:Item>Document.РасходыТовара</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СвязанныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОсновноеИзображениеОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаИзображение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаИзображения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеИзображения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзображениеВБазеДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПриОтображении</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РазмерыКартинок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПоГоризонтали</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПоВертикали</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копирайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Enums/РазмерыКартинок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>РазмерыКартинок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвтоРазмер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пропорционально</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Растянуть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеальныйРазмер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черепица</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CF/Catalogs/Изображения/Forms/ФормаВыбора/Ext/Form/Module.bsl
// sza131216-1219  
// sza131212-0306  
&НаКлиенте
Процедура отображатьКартинкуПриИзменении(Элемент)
	
	ЭтаФорма.Элементы.ГруппаСправа.Видимость = отображатьКартинку;
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Элементы.Список.ПодчиненныеЭлементы.ссылкаНаКартинку.Видимость  = отображатьКартинку;
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервереБезКонтекста
функция    ПолучитьСтруктуруИзображения(СсылкаНаЭлементИзображение)
	
	Результат = Новый Структура("ИзображениеВБазеДанных", СсылкаНаЭлементИзображение.ИзображениеВБазеДанных);
	Результат.Вставить("подссылку", "");
	
	Если Результат.ИзображениеВБазеДанных Тогда
		
		результат.подссылку = ПолучитьНавигационнуюСсылку(СсылкаНаЭлементИзображение, "ХранилищеИзображения");
		
		РазмерПриОтображении = СсылкаНаЭлементИзображение.РазмерПриОтображении;
		
		Если НЕ ЗначениеЗаполнено(РазмерПриОтображении) 
			ИЛИ РазмерПриОтображении = Перечисления.РазмерыКартинок.АвтоРазмер тогда
			
			результат.Вставить("РазмерПриОтображении", 1);
		ИначеЕсли РазмерПриОтображении = Перечисления.РазмерыКартинок.Пропорционально тогда
			результат.Вставить("РазмерПриОтображении", 2);
		ИначеЕсли РазмерПриОтображении = Перечисления.РазмерыКартинок.Растянуть тогда
			результат.Вставить("РазмерПриОтображении", 3);
		ИначеЕсли РазмерПриОтображении = Перечисления.РазмерыКартинок.РеальныйРазмер тогда
			результат.Вставить("РазмерПриОтображении", 4);
		ИначеЕсли РазмерПриОтображении = Перечисления.РазмерыКартинок.Черепица тогда
			результат.Вставить("РазмерПриОтображении", 5);
		Иначе
			результат.Вставить("РазмерПриОтображении", 1);
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(СсылкаНаЭлементИзображение.ИмяФайлаИзображения) Тогда
		результат.подссылку = "<!DOCTYPE html PUBLIC ""-//W3C//DTD XHTML 1.0 Transitional//EN"" 
		|""http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"">
		|<HTML style=""font-family:arial; font-size:11px;"">
		|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8""/>
		|<img src = """ + СсылкаНаЭлементИзображение.ИмяФайлаИзображения + """>
		|</HTML>";
		результат.Вставить("РазмерПриОтображении", 1);
		
	ИначеЕсли ЗначениеЗаполнено(СсылкаНаЭлементИзображение.СсылкаНаИзображение) Тогда
		результат.подссылку = "<!DOCTYPE html PUBLIC ""-//W3C//DTD XHTML 1.0 Transitional//EN"" 
		|""http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"">
		|<HTML style=""font-family:arial; font-size:11px;"">
		|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8""/>
		|<img src = """ + СсылкаНаЭлементИзображение.СсылкаНаИзображение + """>
		|</HTML>";
		результат.Вставить("РазмерПриОтображении", 1);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущийЭлементСписка = Элементы.Список.ТекущаяСтрока;
	Если ЗначениеЗаполнено(ТекущийЭлементСписка) Тогда
		СтруктураИзображения = ПолучитьСтруктуруИзображения(ТекущийЭлементСписка);
		ПодСсылку = СтруктураИзображения.ПодСсылку;
		Элементы.СсылкаНаИзображение.Видимость 	  = НЕ СтруктураИзображения.ИзображениеВБазеДанных;
		Элементы.ИзображениеВБазеДанных.Видимость = СтруктураИзображения.ИзображениеВБазеДанных;
		если СтруктураИзображения.РазмерПриОтображении = 1 тогда
			Элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.АвтоРазмер
		иначеесли СтруктураИзображения.РазмерПриОтображении = 2 тогда
			Элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.Пропорционально
		иначеесли СтруктураИзображения.РазмерПриОтображении = 3 тогда
			Элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.Растянуть
		иначеесли СтруктураИзображения.РазмерПриОтображении = 4 тогда
			Элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.РеальныйРазмер
		иначеесли СтруктураИзображения.РазмерПриОтображении = 5 тогда
			Элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.Черепица
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
		ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
	КонецЕсли;
	
	ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
	
КонецПроцедуры
